dojo_dashboard_I/app/controllers/dojos_controller.rb

SELECT "dojos".* FROM "dojos"
---
  def index
    @dojos = Dojo.all

INSERT INTO "dojos" ("branch", "street", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["branch", "Dubai"], ["street", "dunno"], ["city", "Dubai"], ["state", "UAE"], ["created_at", "2017-07-12 19:07:37.714920"], ["updated_at", "2017-07-12 19:07:37.714920"]]
---
  def create
    @dojo = Dojo.new(dojo_params)

    if @dojo.save