dojo_dashboard_I/app/controllers/students_controller.rb

  def new
    @dojos = Dojo.all
    @dojo = Dojo.find(params[:dojo_id])
---
SELECT "dojos".* FROM "dojos"
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @student = Student.new(student_params)

    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "email", "dojo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "leibel"], ["last_name", "hecht"], ["email", "hi@bye.com"], ["dojo_id", 1], ["created_at", "2017-07-13 16:48:51.537458"], ["updated_at", "2017-07-13 16:48:51.537458"]]

  def edit
    @dojos = Dojo.all
    @student = Student.find(params[:id])
---
SELECT "dojos".* FROM "dojos"
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @student = Student.find(params[:id])

    if @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "nochums"], ["updated_at", "2017-07-13 16:59:38.887662"], ["id", 1]]